app/views/comments/_comment.html.erb

INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "This is a comment with some ajax"], ["post_id", 9], ["user_id", 11], ["created_at", "2016-04-20 15:16:43.908764"], ["updated_at", "2016-04-20 15:16:43.908764"]]
---
      <small>
        <%= comment.user.name %> commented <%= time_ago_in_words(comment.created_at) %> ago