app/controllers/api/v1/topics_controller.rb

  def update
    topic = Topic.find(params[:id])

    if topic.update_attributes(topic_params)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?

  def create
    topic = Topic.new(topic_params)

    if topic.valid?
      topic.save!
---
INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def destroy
    topic = Topic.find(params[:id])

    if topic.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]