app/controllers/api/v1/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Billy Bob"], ["password_digest", "$2a$10$I9Ws6TueyeuEsLvTQXJm4e6aQQX9UmgeBT3swobS/3jrxPOJuX7EK"], ["updated_at", "2016-04-20 19:16:49.344917"], ["id", 1]]

  def create
    user = User.new(user_params)
    if user.valid?
      user.save!
---
INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at", "auth_token") VALUES (?, ?, ?, ?, ?, ?, ?)