app/controllers/comments_controller.rb

  def create
    if params[:post_id]
       parent = Post.find(params[:post_id])
    else
       parent = Topic.find(params[:topic_id])
    end

    comment = Comment.new(comment_params)
    comment.user = current_user
    parent.comments << comment
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 20]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sadsaasddsaads"], ["post_id", 20], ["user_id", 8], ["created_at", "2016-04-11 21:28:23.321423"], ["updated_at", "2016-04-11 21:28:23.321423"]]

  def destroy
    if params[:post_id]
       parent = Post.find(params[:post_id])
    else
       parent = Topic.find(params[:topic_id])
    end

    comment = parent.comments.find(params[:id])


    if comment.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 20]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ?  ORDER BY updated_at DESC LIMIT 1  [["post_id", 9], ["id", 102]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 102]]