app/controllers/favorites_controller.rb

    def create
      post = Post.find(params[:post_id])
      favorite = current_user.favorites.build(post:post)

      if favorite.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY rank DESC LIMIT 1  [["id", 31]]
INSERT INTO "favorites" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 31], ["user_id", 9], ["created_at", "2016-04-17 20:39:55.747024"], ["updated_at", "2016-04-17 20:39:55.747024"]]