app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nvhv"], ["description", "nnm"], ["created_at", "2016-03-20 04:00:20.830590"], ["updated_at", "2016-03-20 04:00:20.830590"]]
---
  def create
    #@topic = Topic.new
    #@topic.name = params[:topic][:name]
    #@topic.description = params[:topic][:description]
    #@topic.public = params[:topic][:public]
    @topic = Topic.new(topic_params)
    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @topic = Topic.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?
---
  def update
    @topic = Topic.find(params[:id])
    #@topic.name = params[:topic][:name]
    #@topic.description = params[:topic][:description]
    #@topic.public = params[:topic][:public]
    @topic.assign_attributes(topic_params)
    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic = Topic.find(params[:id])

    if @topic.destroy